<a href="https://colab.research.google.com/github/Meghashyamt/python/blob/master/numseriesdataframeprac.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
np.random.seed(101)

In [0]:
from numpy.random import randn

In [0]:
df = pd.DataFrame(randn(5,4),'A B C D E '.split(),'W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [0]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df['new'] = [1,2,3,4,5]
df.drop('new',axis = 1, inplace= True)

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df.drop('Y', axis =1)

          W         X         Z
A  2.706850  0.628133  0.503826
B  0.651118 -0.319318  0.605965
C -2.018168  0.740122 -0.589001
D  0.188695 -0.758872  0.955057
E  0.190794  1.978757  0.683509

In [0]:
df.loc[['A','B','C']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [0]:
df.iloc[2:5,0:3]

          W         X         Y
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [0]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df[df['Y']>0]['Y']

A    0.907969
C    0.528813
E    2.605967
Name: Y, dtype: float64

In [0]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [0]:
df.index = [1,2,3,4,5]
df

          W         X         Y         Z
1  2.706850  0.628133  0.907969  0.503826
2  0.651118 -0.319318 -0.848077  0.605965
3 -2.018168  0.740122  0.528813 -0.589001
4  0.188695 -0.758872 -0.933237  0.955057
5  0.190794  1.978757  2.605967  0.683509

In [0]:
df.index.name = ['Groups','Numbers']
df

                          W         X         Y         Z
[Groups, Numbers]
1                  2.706850  0.628133  0.907969  0.503826
2                  0.651118 -0.319318 -0.848077  0.605965
3                 -2.018168  0.740122  0.528813 -0.589001
4                  0.188695 -0.758872 -0.933237  0.955057
5                  0.190794  1.978757  2.605967  0.683509

In [0]:
df.columns.names

FrozenList([None])

In [0]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [0]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [0]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [0]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [0]:
df.fillna('any_value')

           A          B  C
0          1          5  1
1          2  any_value  2
2  any_value  any_value  3

In [0]:
df['A'].fillna(df['A'].mean(),inplace = True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [0]:
data = {'Company': ['GooG','GooG','FB','FB','MS','MS'],
         'Persons': ['Nikita','humera','shyam','Nainitha','  bhasheer','sathwik'],
         'Sales':  [100,200,300,400,250,320]}

In [0]:
df= pd.DataFrame(data)
df.loc[2,:]

Company       FB
Persons    shyam
Sales        300
Name: 2, dtype: object

In [0]:
gbc=df.groupby('Company')
gbc.describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
GooG      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
MS        2.0  285.0  49.497475  250.0  267.5  285.0  302.5  320.0

In [0]:
#gbc.loc[['FB']]

In [0]:
df1= pd.DataFrame({
    'A': 'A0 A1 A2 A3'.split(),
    'B': 'B0 B1 B2 B3'.split(),
    'C': 'C0 C1 C2 C3'.split(),
    'D': 'D0 D1 D2 D3'.split()
    
})

df2= pd.DataFrame({
    'A': 'A4 A5 A6 A7'.split(),
    'B': 'B4 B5 B6 B7'.split(),
    'C': 'C0 C1 C2 C3'.split(),
    'D': 'D0 D1 D2 D3'.split()
    
})

df3= pd.DataFrame({
    'A': 'A8 A9 A10 A11'.split(),
    'B': 'B8 B9 B10 B11'.split(),
    'C': 'C0 C1 C2 C3'.split(),
    'D': 'D0 D1 D2 D3'.split()
    
})

In [0]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [0]:
df2

    A   B   C   D
0  A4  B4  C0  D0
1  A5  B5  C1  D1
2  A6  B6  C2  D2
3  A7  B7  C3  D3

In [0]:
df3.index = [4,5,6,7]

In [0]:
#Concat  Merge  Join
pd.concat([df1,df2,df3])

     A    B   C   D
0   A0   B0  C0  D0
1   A1   B1  C1  D1
2   A2   B2  C2  D2
3   A3   B3  C3  D3
0   A4   B4  C0  D0
1   A5   B5  C1  D1
2   A6   B6  C2  D2
3   A7   B7  C3  D3
4   A8   B8  C0  D0
5   A9   B9  C1  D1
6  A10  B10  C2  D2
7  A11  B11  C3  D3

In [0]:
pd.concat([df1,df2,df3], axis=1)

     A    B    C    D    A    B    C    D    A    B    C    D
0   A0   B0   C0   D0   A4   B4   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1   A5   B5   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2   A6   B6   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3   A7   B7   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C0   D0
5  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C1   D1
6  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10   C2   D2
7  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11   C3   D3

In [0]:
df2

    A   B   C   D
0  A4  B4  C0  D0
1  A5  B5  C1  D1
2  A6  B6  C2  D2
3  A7  B7  C3  D3

In [0]:
df2.loc[1,:]

A    A5
B    B5
C    C1
D    D1
Name: 1, dtype: object

In [0]:
df=pd.DataFrame({'c1': [1,2,3,4],'c2': [5,6,7,8],'c3': ['abc','def','ijk','xyz']})
df

   c1  c2   c3
0   1   5  abc
1   2   6  def
2   3   7  ijk
3   4   8  xyz

In [0]:
df

   c1  c2   c3
0   1   5  abc
1   2   6  def
2   3   7  ijk
3   4   8  xyz

In [0]:
df[(df['c1']>2)&(df['c2']==8)]

   c1  c2   c3
3   4   8  xyz

In [0]:
df.sort_values(by='c2')

   c1  c2   c3
0   1   5  abc
1   2   6  def
2   3   7  ijk
3   4   8  xyz

In [0]:
df.isnull()

      c1     c2     c3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [0]:
df =pd.DataFrame({
    'A':['abc','ghgf']
})

In [0]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [0]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64